In [21]:
import sqlite3
import pandas as pd

In [22]:
# Hubungkan ke database
conn = sqlite3.connect("cmail.db")

In [23]:
# Cek daftar tabel
tables = pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", conn)
display(tables)

              name
0            users
1  sqlite_sequence
2         messages
3            files

ISI TABEL USERS

In [24]:

users_df = pd.read_sql_query("SELECT * FROM users;", conn)
users_df

,id,username,email,password_hash,profile_pic,public_key,private_key,created_at
0,1,papo,itanikita20005@gmail.com,"$argon2id$v=19$m=65536,t=3,p=4$mBPCmDNGqLU2Zox...",None,None,None,2025-11-04 03:32:48
1,2,aiuerue,123230044@student.upnyk.ac.id,"$argon2id$v=19$m=65536,t=3,p=4$/p+TsnbuXQuB0Br...",None,None,None,2025-11-04 03:33:09

ISI TABEL MESSAGE

In [25]:
message_df = pd.read_sql_query("SELECT * FROM messages;", conn)
message_df

Empty DataFrame
Columns: [id, sender_id, receiver_id, subject, content_encrypted, status, timestamp, is_read]
Index: []

ISI TABEL FILES

In [26]:

files_df = pd.read_sql_query("SELECT * FROM files;", conn)
files_df

Empty DataFrame
Columns: [id, message_id, filename, file_path, file_encryption]
Index: []

ISI TABEL SQLITE_SEQUENCE

In [27]:
sq_df = pd.read_sql_query("SELECT * FROM sqlite_sequence;", conn)
sq_df

    name  seq
0  users    2

In [28]:

# 4️⃣ Tutup koneksi
conn.close()